
&НаКлиенте
Процедура ПриОткрытии(Отказ)    
	АдресКамеры = "http://localhost:5000";
	КартинкаКамеры=АдресКамеры;
КонецПроцедуры

&НаКлиенте
Процедура Реквизит1ДокументСформирован(Элемент)
	//// Вставить содержимое обработчика.
	//	Реквизит1="http://localhost:5000/";
	//	ДокументHTML = Элементы.Реквизит1.Документ;
	//    //ДокументHTML.URL="http://localhost:5000/"   ;
	//	АдресHTML = ДокументHTML.URL;

	//	Текст_HTML = ДокументHTML.documentElement.innerHTML;
КонецПроцедуры

&НаКлиенте
Процедура АдресКамерыПриИзменении(Элемент)
	КартинкаКамеры=АдресКамеры
КонецПроцедуры
